import re


class CountryRecognizer:
    def __init__(self):
        self.patterns = []
        self.capital_to_country = {}

        africa_countries = [
            ('Алжир', 'Алжиру', 'Алжирі'),
            ('Ангола', 'Анголі', 'Анголі'),
            ('Бенін', 'Беніну', 'Беніні'),
            ('Ботсвана', 'Ботсвані', 'Ботсвані'),
            ('Буркіна-Фасо', 'Буркіна-Фасо', 'Буркіна-Фасо'),
            ('Бурунді', 'Бурунді', 'Бурунді'),
            ('Габон', 'Габону', 'Габоні'),
            ('Гамбія', 'Гамбії', 'Гамбії'),
            ('Гана', 'Гані', 'Гані'),
            ('Гвінея', 'Гвінеї', 'Гвінеї'),
            ('Єгипет', 'Єгипту', 'Єгипті'),
            ('Замбія', 'Замбії', 'Замбії'),
            ('Зімбабве', 'Зімбабве', 'Зімбабве'),
            ('Камерун', 'Камеруну', 'Камеруні'),
            ('Кенія', 'Кенії', 'Кенії'),
            ('Лівія', 'Лівії', 'Лівії'),
            ('Мадагаскар', 'Мадагаскару', 'Мадагаскарі'),
            ('Малаві', 'Малаві', 'Малаві'),
            ('Малі', 'Малі', 'Малі'),
            ('Марокко', 'Марокко', 'Марокко'),
            ('Мозамбік', 'Мозамбіку', 'Мозамбіку'),
            ('Намібія', 'Намібії', 'Намібії'),
            ('Нігер', 'Нігеру', 'Нігері'),
            ('Нігерія', 'Нігерії', 'Нігерії'),
            ('Руанда', 'Руанди', 'Руанді'),
            ('Сенегал', 'Сенегалу', 'Сенегалі'),
            ('Сомалі', 'Сомалі', 'Сомалі'),
            ('Судан', 'Судану', 'Судані'),
            ('Танзанія', 'Танзанії', 'Танзанії'),
            ('Туніс', 'Тунісу', 'Тунісі'),
            ('Уганда', 'Уганді', 'Уганді'),
            ('Центральноафриканська Республіка', 'Центральноафриканської Республіки',
             'Центральноафриканській Республіці'),
            ('Чад', 'Чаду', 'Чаді'),
            ('Ефіопія', 'Ефіопії', 'Ефіопії'),
            ('Південна Африка', 'Південній Африці', 'Південній Африці'),
            ('Конго', 'Конго', 'Конго'),
            ('Кот-д’Івуар', 'Кот-д’Івуару', 'Кот-д’Івуарі'),
            ('Лесото', 'Лесото', 'Лесото'),
            ('Ліберія', 'Ліберії', 'Ліберії')
        ]

        asia_countries = [
            ('Афганістан', 'Афганістану', 'Афганістані'),
            ('Бангладеш', 'Бангладешу', 'Бангладеші'),
            ('Бутан', 'Бутану', 'Бутані'),
            ('В’єтнам', 'В’єтнаму', 'В’єтнамі'),
            ('Індія', 'Індії', 'Індії'),
            ('Індонезія', 'Індонезії', 'Індонезії'),
            ('Ірак', 'Іраку', 'Іраку'),
            ('Іран', 'Ірану', 'Ірані'),
            ('Йорданія', 'Йорданії', 'Йорданії'),
            ('Камбоджа', 'Камбоджі', 'Камбоджі'),
            ('Китай', 'Китаю', 'Китаї'),
            ('Корея', 'Кореї', 'Кореї'),
            ('Лаос', 'Лаосу', 'Лаосі'),
            ('Ліван', 'Лівану', 'Лівані'),
            ('Малайзія', 'Малайзії', 'Малайзії'),
            ('Мальдіви', 'Мальдів', 'Мальдівах'),
            ('М’янма', 'М’янми', 'М’янмі'),
            ('Непал', 'Непалу', 'Непалі'),
            ('Оман', 'Оману', 'Омані'),
            ('Пакистан', 'Пакистану', 'Пакистані'),
            ('Саудівська Аравія', 'Саудівської Аравії', 'Саудівській Аравії'),
            ('Сирія', 'Сирії', 'Сирії'),
            ('Таїланд', 'Таїланду', 'Таїланді'),
            ('Туреччина', 'Туреччини', 'Туреччині'),
            ('Філіппіни', 'Філіппін', 'Філіппінах'),
            ('Шрі-Ланка', 'Шрі-Ланки', 'Шрі-Ланці'),
            ('Японія', 'Японії', 'Японії')
        ]

        europe_countries = [
            ('Албанія', 'Албанії', 'Албанії'),
            ('Андорра', 'Андорри', 'Андоррі'),
            ('Австрія', 'Австрії', 'Австрії'),
            ('Білорусь', 'Білорусі', 'Білорусі'),
            ('Бельгія', 'Бельгії', 'Бельгії'),
            ('Боснія і Герцеговина', 'Боснії і Герцеговини', 'Боснії і Герцеговині'),
            ('Болгарія', 'Болгарії', 'Болгарії'),
            ('Ватикан', 'Ватикану', 'Ватикані'),
            ('Велика Британія', 'Великої Британії', 'Великій Британії'),
            ('Угорщина', 'Угорщини', 'Угорщині'),
            ('Німеччина', 'Німеччини', 'Німеччині'),
            ('Греція', 'Греції', 'Греції'),
            ('Данія', 'Данії', 'Данії'),
            ('Ірландія', 'Ірландії', 'Ірландії'),
            ('Ісландія', 'Ісландії', 'Ісландії'),
            ('Іспанія', 'Іспанії', 'Іспанії'),
            ('Італія', 'Італії', 'Італії'),
            ('Латвія', 'Латвії', 'Латвії'),
            ('Литва', 'Литви', 'Литві'),
            ('Люксембург', 'Люксембургу', 'Люксембургу'),
            ('Мальта', 'Мальти', 'Мальті'),
            ('Молдова', 'Молдови', 'Молдові'),
            ('Монако', 'Монако', 'Монако'),
            ('Нідерланди', 'Нідерландів', 'Нідерландах'),
            ('Норвегія', 'Норвегії', 'Норвегії'),
            ('Польща', 'Польщі', 'Польщі'),
            ('Португалія', 'Португалії', 'Португалії'),
            ('Росія', 'Росії', 'Росії'),
            ('Румунія', 'Румунії', 'Румунії'),
            ('Сан-Марино', 'Сан-Марино', 'Сан-Марино'),
            ('Сербія', 'Сербії', 'Сербії'),
            ('Словаччина', 'Словаччини', 'Словаччині'),
            ('Словенія', 'Словенії', 'Словенії'),
            ('Україна', 'України', 'Україні'),
            ('Фінляндія', 'Фінляндії', 'Фінляндії'),
            ('Франція', 'Франції', 'Франції'),
            ('Хорватія', 'Хорватії', 'Хорватії'),
            ('Чехія', 'Чехії', 'Чехії'),
            ('Швейцарія', 'Швейцарії', 'Швейцарії'),
            ('Швеція', 'Швеції', 'Швеції'),
            ('Естонія', 'Естонії', 'Естонії')
        ]

        north_america_countries = [
            ('Антигуа і Барбуда', 'Антигуи і Барбуди', 'Антигуї і Барбуді'),
            ('Багами', 'Багам', 'Багамах'),
            ('Барбадос', 'Барбадосу', 'Барбадосі'),
            ('Беліз', 'Белізу', 'Белізі'),
            ('Гаїті', 'Гаїті', 'Гаїті'),
            ('Гватемала', 'Гватемали', 'Гватемалі'),
            ('Гондурас', 'Гондурасу', 'Гондурасі'),
            ('Гренада', 'Гренади', 'Гренаді'),
            ('Домініка', 'Домініки', 'Домініці'),
            ('Домініканська Республіка', 'Домініканської Республіки', 'Домініканській Республіці'),
            ('Канада', 'Канади', 'Канаді'),
            ('Коста-Рика', 'Коста-Рики', 'Коста-Риці'),
            ('Куба', 'Куби', 'Кубі'),
            ('Мексика', 'Мексики', 'Мексиці'),
            ('Нікарагуа', 'Нікарагуа', 'Нікарагуа'),
            ('Панама', 'Панами', 'Панамі'),
            ('Сальвадор', 'Сальвадору', 'Сальвадорі'),
            ('Сент-Кітс і Невіс', 'Сент-Кітс і Невісу', 'Сент-Кітс н Невісі'),
            ('Сент-Люсія', 'Сент-Люсії', 'Сент-Люсії'),
            ('Сент-Вінсент і Гренадини', 'Сент-Вінсенту і Гренадинам', 'Сент-Вінсенті і Гренадинах'),
            ('Тринідад і Тобаго', 'Тринідаду і Тобаго', 'Тринідаді і Тобаго'),
            ('США', 'США', 'США'),
            ('Ямайка', 'Ямайки', 'Ямайці')
        ]

        south_america_countries = [
            ('Аргентина', 'Аргентини', 'Аргентині'),
            ('Болівія', 'Болівії', 'Болівії'),
            ('Бразилія', 'Бразилії', 'Бразилії'),
            ('Венесуела', 'Венесуели', 'Венесуелі'),
            ('Гайана', 'Гайани', 'Гайані'),
            ('Колумбія', 'Колумбії', 'Колумбії'),
            ('Парагвай', 'Парагваю', 'Парагваї'),
            ('Перу', 'Перу', 'Перу'),
            ('Суринам', 'Суринаму', 'Суринамі'),
            ('Уругвай', 'Уругваю', 'Уругваї'),
            ('Чилі', 'Чилі', 'Чилі'),
            ('Еквадор', 'Еквадору', 'Еквадорі')
        ]
        for continent, countries in [
            ('Африка', africa_countries),
            ('Азія', asia_countries),
            ('Європа', europe_countries),
            ('Північна Америка', north_america_countries),
            ('Південна Америка', south_america_countries)
        ]:
            for country in countries:
                for case in country:
                    self.patterns.append((continent, case, re.compile(r'\b' + case + r'\b', re.IGNORECASE), 'country'))

        africa_countries_capitals = {
            ('Алжир', 'Алжиру', 'Алжирі'): ('Алжир', 'Алжиру', 'Алжирі'),
            ('Ангола', 'Анголи', 'Анголі'): ('Луанда', 'Луанди', 'Луанді'),
            ('Бенін', 'Беніну', 'Беніні'): ('Порто-Ново', 'Порто-Ново', 'Порто-Ново'),
            ('Ботсвана', 'Ботсвани', 'Ботсвані'): ('Габороне', 'Габороне', 'Габороне'),
            ('Буркіна-Фасо', 'Буркіна-Фасо', 'Буркіна-Фасо'): ('Уагадугу', 'Уагадугу', 'Уагадугу'),
            ('Бурунді', 'Бурунді', 'Бурунді'): ('Гітега', 'Гітеги', 'Гітезі'),
            ('Габон', 'Габону', 'Габоні'): ('Лібревіль', 'Лібревілю', 'Лібревілі'),
            ('Гамбія', 'Гамбії', 'Гамбії'): ('Банжул', 'Банжулу', 'Банжулі'),
            ('Гана', 'Гани', 'Гані'): ('Аккра', 'Аккри', 'Аккрі'),
            ('Гвінея', 'Гвінеї', 'Гвінеї'): ('Конакрі', 'Конакрі', 'Конакрі'),
            ('Єгипет', 'Єгипту', 'Єгипті'): ('Каїр', 'Каїру', 'Каїрі'),
            ('Замбія', 'Замбії', 'Замбії'): ('Лусака', 'Лусаки', 'Лусаці'),
            ('Зімбабве', 'Зімбабве', 'Зімбабве'): ('Хараре', 'Хараре', 'Хараре'),
            ('Камерун', 'Камеруну', 'Камеруні'): ('Яунде', 'Яунде', 'Яунде'),
            ('Кенія', 'Кенії', 'Кенії'): ('Найробі', 'Найробі', 'Найробі'),
            ('Лівія', 'Лівії', 'Лівії'): ('Тріполі', 'Тріполі', 'Тріполі'),
            ('Мадагаскар', 'Мадагаскару', 'Мадагаскару'): ('Антананаріву', 'Антананаріву', 'Антананаріву'),
            ('Малаві', 'Малаві', 'Малаві'): ('Лілонгве', 'Лілонгве', 'Лілонгве'),
            ('Малі', 'Малі', 'Малі'): ('Бамако', 'Бамако', 'Бамако'),
            ('Марокко', 'Марокко', 'Марокко'): ('Рабат', 'Рабату', 'Рабаті'),
            ('Мозамбік', 'Мозамбіку', 'Мозамбіку'): ('Мапуту', 'Мапуту', 'Мапуту'),
            ('Намібія', 'Намібії', 'Намібії'): ('Віндгук', 'Віндгуку', 'Віндгуці'),
            ('Нігер', 'Нігеру', 'Нігері'): ('Ніамей', 'Ніамею', 'Ніамеї'),
            ('Нігерія', 'Нігерії', 'Нігерії'): ('Абуджа', 'Абуджи', 'Абуджі'),
            ('Руанда', 'Руанди', 'Руанді'): ('Кігалі', 'Кігалі', 'Кігалі'),
            ('Сенегал', 'Сенегалу', 'Сенегалі'): ('Дакар', 'Дакару', 'Дакарі'),
            ('Сомалі', 'Сомалі', 'Сомалі'): ('Могадишо', 'Могадишо', 'Могадишо'),
            ('Судан', 'Судану', 'Судані'): ('Хартум', 'Хартуму', 'Хартумі'),
            ('Танзанія', 'Танзанії', 'Танзанії'): ('Додома', 'Додома', 'Додома'),
            ('Туніс', 'Тунісу', 'Тунісі'): ('Туніс', 'Тунісу', 'Тунісі'),
            ('Уганда', 'Уганді', 'Уганді'): ('Кампала', 'Кампали', 'Кампалі'),
            ('Центральноафриканська Республіка', 'Центральноафриканської Республіки',
             'Центральноафриканській Республіці'): ('Бангі', 'Бангі', 'Бангі'),
            ('Чад', 'Чаду', 'Чаді'): ('Нджамена', 'Нджамена', 'Нджамена'),
            ('Эфіопія', 'Ефіопії', 'Ефіопії'): ('Аддіс-Абеба', 'Аддіс-Абеби', 'Аддіс-Абебі'),
            ('Південна Африка', 'Південної Африки', 'Південній Африці'): ('Преторія', 'Преторії', 'Преторії'),
            ('Конго', 'Конго', 'Конго'): ('Кіншаса', 'Кіншаси', 'Кіншасі'),
            ('Кот-д’Івуар', 'Кот-д’Івуару', 'Кот-д’Івуарі'): ('Ямусукро', 'Ямусукро', 'Ямусукро'),
            ('Лесото', 'Лесото', 'Лесото'): ('Масеру', 'Масеру', 'Масеру'),
            ('Ліберія', 'Ліберії', 'Ліберії'): ('Монровіа', 'Монровії', 'Монровії')
        }

        for country, capital in africa_countries_capitals.items():
            for cap in capital:
                self.patterns.append(('Африка', cap, re.compile(r'\b' + cap + r'\b', re.IGNORECASE), 'capital'))
                self.capital_to_country[cap] = country[0]

        asia_countries_capitals = {
            ('Афганістан', 'Афганістану', 'Афганістані'): ('Кабул', 'Кабула', 'Кабулі'),
            ('Бангладеш', 'Бангладешу', 'Бангладеші'): ('Дакка', 'Дакки', 'Даці'),
            ('Бутан', 'Бутану', 'Бутані'): ('Тхімпху', 'Тхімпху', 'Тхімпху'),
            ('В’єтнам', 'В’єтнаму', 'В’єтнамі'): ('Ханой', 'Ханою', 'Ханої'),
            ('Індія', 'Індії', 'Індії'): ('Нью-Делі', 'Нью-Делі', 'Нью-Делі'),
            ('Індонезія', 'Індонезії', 'Індонезії'): ('Джакарта', 'Джакарти', 'Джакарті'),
            ('Ірак', 'Іраку', 'Іраку'): ('Багдад', 'Багдаду', 'Багдаді'),
            ('Іран', 'Ірану', 'Ірані'): ('Тегеран', 'Тегерану', 'Тегерані'),
            ('Йорданія', 'Йорданії', 'Йорданії'): ('Амман', 'Амману', 'Аммані'),
            ('Камбоджа', 'Камбоджі', 'Камбоджі'): ('Пномпень', 'Пномпеня', 'Пномпені'),
            ('Китай', 'Китаю', 'Китаї'): ('Пекін', 'Пекіну', 'Пекіні'),
            ('Корея', 'Кореї', 'Кореї'): ('Сеул', 'Сеулу', 'Сеулі'),
            ('Лаос', 'Лаосу', 'Лаосі'): ("В'єнтьян", "В'єнтьяну", "В'єнтьяні"),
            ('Ліван', 'Лівану', 'Лівані'): ('Бейрут', 'Бейруту', 'Бейруті'),
            ('Малайзія', 'Малайзії', 'Малайзії'): ('Куала-Лумпур', 'Куала-Лумпуру', 'Куала-Лумпурі'),
            ('Мальдіви', 'Мальдів', 'Мальдівах'): ('Мале', 'Мале', 'Мале'),
            ('М’янма', 'М’янми', 'М’янмі'): ('Нейп’їдо', 'Нейп’їдо', 'Нейп’їдо'),
            ('Непал', 'Непалу', 'Непалі'): ('Катманду', 'Катманду', 'Катманду'),
            ('Оман', 'Оману', 'Омані'): ('Маскат', 'Маскату', 'Маскаті'),
            ('Пакистан', 'Пакистану', 'Пакистані'): ('Ісламабад', 'Ісламабаду', 'Ісламабаді'),
            ('Саудівська Аравія', 'Саудівської Аравії', 'Саудівській Аравії'): ('Ріяд', 'Ріяда', 'Ріяді'),
            ('Сирія', 'Сирії', 'Сирії'): ('Дамаск', 'Дамаска', 'Дамаску'),
            ('Таїланд', 'Таїланду', 'Таїланді'): ('Банкок', 'Банкоку', 'Банкоку'),
            ('Туреччина', 'Туреччини', 'Туреччині'): ('Анкара', 'Анкари', 'Анкарі'),
            ('Філіппіни', 'Філіппін', 'Філіппінах'): ('Маніла', 'Маніли', 'Манілі'),
            ('Шрі-Ланка', 'Шрі-Ланки', 'Шрі-Ланці'): ('Коломбо', 'Коломбо', 'Коломбо'),
            ('Японія', 'Японії', 'Японії'): ('Токіо', 'Токіо', 'Токіо')
        }

        for country, capital in asia_countries_capitals.items():
            for cap in capital:
                self.patterns.append(('Азія', cap, re.compile(r'\b' + cap + r'\b', re.IGNORECASE), 'capital'))
                self.capital_to_country[cap] = country[0]

        europe_countries_capitals = {
            ('Албанія', 'Албанії', 'Албанії'): ('Тирана', 'Тирани', 'Тирані'),
            ('Андорра', 'Андорри', 'Андоррі'): ('Андорра-ла-Велья', 'Андорри-ла-Вельї', 'Андоррі-ла-Вельї'),
            ('Австрія', 'Австрії', 'Австрії'): ('Відень', 'Відня', 'Відні'),
            ('Білорусь', 'Білорусі', 'Білорусі'): ('Мінськ', 'Мінська', 'Мінську'),
            ('Бельгія', 'Бельгії', 'Бельгії'): ('Брюссель', 'Брюсселя', 'Брюсселі'),
            ('Боснія і Герцеговина', 'Боснії і Герцеговини', 'Боснії і Герцеговині'): ('Сараєво', 'Сараєва', 'Сараєві'),
            ('Болгарія', 'Болгарії', 'Болгарії'): ('Софія', 'Софії', 'Софії'),
            ('Ватикан', 'Ватикану', 'Ватикані'): ('Ватикан', 'Ватикану', 'Ватикані'),
            ('Велика Британія', 'Великої Британії', 'Великій Британії'): ('Лондон', 'Лондона', 'Лондоні'),
            ('Угорщина', 'Угорщини', 'Угорщині'): ('Будапешт', 'Будапешту', 'Будапешті'),
            ('Німеччина', 'Німеччини', 'Німеччині'): ('Берлін', 'Берліна', 'Берліні'),
            ('Греція', 'Греції', 'Греції'): ('Афіни', 'Афін', 'Афінах'),
            ('Данія', 'Данії', 'Данії'): ('Копенгаген', 'Копенгагена', 'Копенгагені'),
            ('Ісландія', 'Ісландії', 'Ісландії'): ('Рейк’явік', 'Рейк’явіку', 'Рейк’явіку'),
            ('Іспанія', 'Іспанії', 'Іспанії'): ('Мадрид', 'Мадрида', 'Мадриді'),
            ('Італія', 'Італії', 'Італії'): ('Рим', 'Риму', 'Римі'),
            ('Латвія', 'Латвії', 'Латвії'): ('Рига', 'Риги', 'Ризі'),
            ('Литва', 'Литви', 'Литві'): ('Вільнюс', 'Вільнюса', 'Вільнюсі'),
            ('Люксембург', 'Люксембургу', 'Люксембурзі'): ('Люксембург', 'Люксембурга', 'Люксембурзі'),
            ('Мальта', 'Мальти', 'Мальті'): ('Валлетта', 'Валлетти', 'Валлетті'),
            ('Молдова', 'Молдови', 'Молдові'): ('Кишинів', 'Кишинева', 'Кишиневі'),
            ('Монако', 'Монако', 'Монако'): ('Монако', 'Монако', 'Монако'),
            ('Нідерланди', 'Нідерландів', 'Нідерландах'): ('Амстердам', 'Амстердама', 'Амстердамі'),
            ('Норвегія', 'Норвегії', 'Норвегії'): ('Осло', 'Осло', 'Осло'),
            ('Польща', 'Польщі', 'Польщі'): ('Варшава', 'Варшави', 'Варшаві'),
            ('Португалія', 'Португалії', 'Португалії'): ('Лісабон', 'Лісабона', 'Лісабоні'),
            ('Росія', 'Росії', 'Росії'): ('Москва', 'Москви', 'Москві'),
            ('Румунія', 'Румунії', 'Румунії'): ('Бухарест', 'Бухаресту', 'Бухаресті'),
            ('Сан-Марино', 'Сан-Марино', 'Сан-Марино'): ('Сан-Марино', 'Сан-Марино', 'Сан-Марино'),
            ('Сербія', 'Сербії', 'Сербії'): ('Белград', 'Белграда', 'Белграді'),
            ('Словаччина', 'Словаччини', 'Словаччині'): ('Братислава', 'Братислави', 'Братиславі'),
            ('Словенія', 'Словенії', 'Словенії'): ('Любляна', 'Любляни', 'Любляні'),
            ('Україна', 'України', 'Україні'): ('Київ', 'Києва', 'Києві'),
            ('Фінляндія', 'Фінляндії', 'Фінляндії'): ('Хельсінкі', 'Хельсінкі', 'Хельсінкі'),
            ('Франція', 'Франції', 'Франції'): ('Париж', 'Парижа', 'Парижі'),
            ('Хорватія', 'Хорватії', 'Хорватії'): ('Загреб', 'Загреба', 'Загребі'),
            ('Чехія', 'Чехії', 'Чехії'): ('Прага', 'Праги', 'Празі'),
            ('Швейцарія', 'Швейцарії', 'Швейцарії'): ('Берн', 'Берна', 'Берні'),
            ('Швеція', 'Швеції', 'Швеції'): ('Стокгольм', 'Стокгольма', 'Стокгольмі'),
            ('Естонія', 'Естонії', 'Естонії'): ('Таллінн', 'Таллінна', 'Таллінні')
        }

        for country, capital in europe_countries_capitals.items():
            for cap in capital:
                self.patterns.append(('Європа', cap, re.compile(r'\b' + cap + r'\b', re.IGNORECASE), 'capital'))
                self.capital_to_country[cap] = country[0]

        north_america_countries_capitals = {
            ('Антигуа і Барбуда', 'Антигуа і Барбуди', 'Антигуа і Барбуді'): (
            'Сент-Джонс', 'Сент-Джонса', 'Сент-Джонсі'),
            ('Багами', 'Багам', 'Багамах'): ('Насау', 'Насау', 'Насау'),
            ('Барбадос', 'Барбадосу', 'Барбадосі'): ('Бриджтаун', 'Бриджтауну', 'Бриджтауні'),
            ('Беліз', 'Белізу', 'Белізі'): ('Белмопан', 'Белмопану', 'Белмопані'),
            ('Гаїті', 'Гаїті', 'Гаїті'): ('Порт-о-Пренс', 'Порт-о-Пренс', 'Порт-о-Пренс'),
            ('Гватемала', 'Гватемали', 'Гватемалі'): ('Гватемала', 'Гватемали', 'Гватемалі'),
            ('Гондурас', 'Гондурасу', 'Гондурасі'): ('Тегусігальпа', 'Тегусігальпи', 'Тегусігальпі'),
            ('Гренада', 'Гренади', 'Гренаді'): ('Сент-Джорджес', 'Сент-Джорджеса', 'Сент-Джорджесі'),
            ('Домініка', 'Домініки', 'Домініці'): ('Розо', 'Розо', 'Розо'),
            ('Домініканська Республіка', 'Домініканської Республіки', 'Домініканській Республіці'): (
            'Санто-Домінго', 'Санто-Домінго', 'Санто-Домінго'),
            ('Канада', 'Канади', 'Канаді'): ('Оттава', 'Оттави', 'Оттаві'),
            ('Коста-Рика', 'Коста-Рики', 'Коста-Риці'): ('Сан-Хосе', 'Сан-Хосе', 'Сан-Хосе'),
            ('Куба', 'Куби', 'Кубі'): ('Гавана', 'Гавани', 'Гавані'),
            ('Мексика', 'Мексики', 'Мексиці'): ('Мехіко', 'Мехіко', 'Мехіко'),
            ('Нікарагуа', 'Нікарагуа', 'Нікарагуа'): ('Манагуа', 'Манагуа', 'Манагуа'),
            ('Панама', 'Панами', 'Панамі'): ('Панама', 'Панами', 'Панамі'),
            ('Сальвадор', 'Сальвадору', 'Сальвадорі'): ('Сан-Сальвадор', 'Сан-Сальвадору', 'Сан-Сальвадорі'),
            ('Сент-Кітс і Невіс', 'Сент-Кітсу і Невісу', 'Сент-Кітсу і Невісу'): ('Бастер', 'Бастеру', 'Бастеру'),
            ('Сент-Люсія', 'Сент-Люсії', 'Сент-Люсії'): ('Кастри', 'Кастра', 'Кастра'),
            ('Сент-Вінсент і Гренадини', 'Сент-Вінсенту і Гренадинам', 'Сент-Вінсенту і Гренадинах'): (
            'Кінгстаун', 'Кінгстауну', 'Кінгстауні'),
            ('Тринідад і Тобаго', 'Тринідаду і Тобаго', 'Тринідаді і Тобаго'): (
            'Порт-оф-Спейн', 'Порт-оф-Спейна', 'Порт-оф-Спейні'),
            ('США', 'США', 'США'): ('Вашингтон', 'Вашингтона', 'Вашингтоні'),
            ('Ямайка', 'Ямайки', 'Ямайці'): ('Кінгстон', 'Кінгстона', 'Кінгстоні')
        }

        south_america_countries_capitals = {
            ('Аргентина', 'Аргентини', 'Аргентині'): ('Буенос-Айрес', 'Буенос-Айреса', 'Буенос-Айресі'),
            ('Болівія', 'Болівії', 'Болівії'): ('Ла-Пас', 'Ла-Пасу', 'Ла-Пасі'),
            ('Бразилія', 'Бразилії', 'Бразилії'): ('Бразилія', 'Бразилії', 'Бразилії'),
            ('Венесуела', 'Венесуели', 'Венесуелі'): ('Каракас', 'Каракаса', 'Каракасі'),
            ('Гайана', 'Гайани', 'Гайані'): ('Джорджтаун', 'Джорджтауну', 'Джорджтауні'),
            ('Колумбія', 'Колумбії', 'Колумбії'): ('Богота', 'Боготи', 'Боготі'),
            ('Парагвай', 'Парагваю', 'Парагваї'): ('Асунсьйон', 'Асунсьйону', 'Асунсьйоні'),
            ('Перу', 'Перу', 'Перу'): ('Ліма', 'Лімою', 'Лімою'),
            ('Суринам', 'Суринаму', 'Сурінамі'): ('Парамарибо', 'Парамарибо', 'Парамарибо'),
            ('Уругвай', 'Уругваю', 'Уругваї'): ('Монтевідео', 'Монтевідео', 'Монтевідео'),
            ('Чилі', 'Чилі', 'Чілі'): ('Сантьяго', 'Сантьяго', 'Сантьяго'),
            ('Еквадор', 'Еквадору', 'Еквадорі'): ('Кіто', 'Кіта', 'Кіто')
        }

        for country, capital in north_america_countries_capitals.items():
            for cap in capital:
                self.patterns.append(('Північна Америка', cap, re.compile(r'\b' + cap + r'\b', re.IGNORECASE), 'capital'))
                self.capital_to_country[cap] = country[0]

        for country, capital in south_america_countries_capitals.items():
            for cap in capital:
                self.patterns.append(('Південна Америка', cap, re.compile(r'\b' + cap + r'\b', re.IGNORECASE), 'capital'))
                self.capital_to_country[cap] = country[0]

    def read_text_from_file(self, filepath):
        try:
            with open(filepath, 'r', encoding='utf-8') as file:
                return file.read()
        except FileNotFoundError:
            print(f"Файл {filepath} не знайдено.")
            return None

    def _get_capital_by_country(self, continent, country):
        return self.capitals[continent][country]

    def recognize(self, filepath):
        text = self.read_text_from_file(filepath)
        countries = set()
        continents_countries = set()
        continents_countries_capitals = set()

        if text is not None:
            for continent, name, regex, entity_type in self.patterns:
                for match in regex.finditer(text):
                    position = match.span()

                    if entity_type == 'country':
                        countries.add(f"{name} - {position}")
                        continents_countries.add(f"{continent}: {name} - {position}")
                    elif entity_type == 'capital':
                        country = self.capital_to_country.get(name, "Unknown Country")
                        continents_countries_capitals.add(f"{continent}: {country}: {name} (capital) - {position}")

            print("First pass (Country):")
            print("\n".join(countries))

            print("\nSecond pass (Continent, Country):")
            print("\n".join(continents_countries))

            print("\nThird pass (Continent, Country, Capital):")
            print("\n".join(sorted(continents_countries_capitals)))


recognizer = CountryRecognizer()
recognizer.recognize('input_countries.txt')
